import {
  FiShoppingCart,
  FiBriefcase,
  FiBook,
  FiHome,
  FiHeart,
  FiMonitor,
  FiShield,
  FiBookOpen,
  FiMap,
} from "react-icons/fi";

export const services = [
  {
    id: 1,

    slug: "shop",

    title: "سایت فروشگاهی",

    desc: "طراحی فروشگاه اینترنتی",

    longDesc:
      "طراحی سایت فروشگاهی حرفه‌ای با امکانات کامل مانند مدیریت محصولات، سبد خرید، درگاه پرداخت، پنل کاربران، سیستم تخفیف، مدیریت سفارشات و طراحی کاملاً ریسپانسیو.",

    features: ["طراحی اختصاصی", "ریسپانسیو", "سرعت بالا", "پنل مدیریت", "سئو"],

    technologies: ["React", "JavaScript", "WordPress"],

    price: "شروع از ۲۰ میلیون",

    image: "",

    icon: FiShoppingCart,

    color: "#8B5CF6",
  },
  {
    id: 2,
    slug: "company",
    title: "سایت شرکتی",
    desc: "معرفی خدمات، نمونه کارها و اطلاعات شرکت",

    longDesc:
      "طراحی سایت شرکتی حرفه‌ای برای معرفی شرکت، خدمات، نمونه‌کارها، تیم، مشتریان و راه‌های ارتباطی با طراحی مدرن و کاملاً ریسپانسیو.",

    features: [
      "طراحی اختصاصی",
      "معرفی خدمات",
      "صفحه درباره ما",
      "نمایش نمونه کارها",
      "فرم تماس",
      "سئو تکنیکال",
    ],

    technologies: ["React", "JavaScript", "WordPress"],

    price: "شروع از ۱۵ میلیون تومان",

    time: "۱۵ تا ۲۰ روز کاری",

    icon: FiBriefcase,
    color: "#3B82F6",
  },

  {
    id: 3,
    slug: "education",
    title: "سایت آموزشی",
    desc: "برگزاری دوره، آزمون و فروش آموزش",

    longDesc:
      "طراحی سایت آموزشی برای فروش دوره‌های آنلاین، برگزاری آزمون، مدیریت دانشجویان و ارائه گواهینامه.",

    features: [
      "فروش دوره",
      "برگزاری آزمون",
      "پنل مدرس",
      "پنل دانشجو",
      "صدور گواهینامه",
      "درگاه پرداخت",
    ],

    technologies: ["React", "Laravel", "WordPress"],

    price: "شروع از ۲۵ میلیون تومان",

    time: "۲۵ تا ۳۵ روز کاری",

    icon: FiBook,
    color: "#22C55E",
  },

  {
    id: 4,
    slug: "medical",
    title: "سایت پزشکی",
    desc: "نوبت دهی و معرفی پزشکان",

    longDesc:
      "طراحی سایت پزشکی با امکان معرفی پزشکان، رزرو آنلاین نوبت، معرفی خدمات درمانی و انتشار مقالات پزشکی.",

    features: [
      "رزرو آنلاین",
      "معرفی پزشکان",
      "مقالات پزشکی",
      "فرم تماس",
      "ریسپانسیو",
      "سئو",
    ],

    technologies: ["React", "Laravel"],

    price: "شروع از ۱۸ میلیون تومان",

    time: "۲۰ تا ۲۵ روز کاری",

    icon: FiHeart,
    color: "#F97316",
  },

  {
    id: 5,
    slug: "real-estate",
    title: "سایت املاک",
    desc: "ثبت و مدیریت فایل های ملکی",

    longDesc:
      "طراحی سایت املاک برای ثبت فایل‌ها، جستجوی پیشرفته، معرفی پروژه‌ها و ارتباط مستقیم مشتری با مشاور.",

    features: [
      "ثبت فایل",
      "جستجوی پیشرفته",
      "نمایش روی نقشه",
      "مدیریت فایل‌ها",
      "تماس با مشاور",
      "ریسپانسیو",
    ],

    technologies: ["React", "Laravel"],

    price: "شروع از ۲۲ میلیون تومان",

    time: "۲۰ تا ۳۰ روز کاری",

    icon: FiHome,
    color: "#EF4444",
  },
  {
    id: 6,
    slug: "news",
    title: "سایت خبری",
    desc: "انتشار اخبار، مقالات و اطلاعیه‌ها",

    longDesc:
      "طراحی سایت خبری با دسته‌بندی اخبار، جستجو، انتشار مقالات و مدیریت نویسندگان.",

    features: [
      "انتشار اخبار",
      "دسته‌بندی",
      "پنل نویسندگان",
      "جستجو",
      "سئو",
      "ریسپانسیو",
    ],

    technologies: ["React", "WordPress"],

    price: "شروع از ۱۴ میلیون تومان",

    time: "۱۵ تا ۲۰ روز کاری",

    icon: FiBookOpen,
    color: "#f6f209ff",
  },
  {
    id: 7,
    slug: "tourism",
    title: "سایت گردشگری",
    desc: "معرفی تورها و جاذبه‌های گردشگری",

    longDesc:
      "طراحی سایت گردشگری برای معرفی تورها، رزرو آنلاین، معرفی جاذبه‌ها و انتشار مقالات سفر.",

    features: [
      "معرفی تورها",
      "رزرو آنلاین",
      "وبلاگ سفر",
      "گالری تصاویر",
      "ریسپانسیو",
      "سئو",
    ],

    technologies: ["React", "Laravel"],

    price: "شروع از ۲۰ میلیون تومان",

    time: "۲۰ تا ۳۰ روز کاری",

    icon: FiMap,
    color: "#f609abff",
  },
  {
    id: 8,
    slug: "law",
    title: "سایت وکالت",
    desc: "معرفی خدمات حقوقی و مشاوره آنلاین",

    longDesc:
      "طراحی سایت وکالت برای معرفی خدمات حقوقی، رزرو مشاوره، معرفی وکلا و انتشار مقالات حقوقی.",

    features: [
      "رزرو مشاوره",
      "معرفی وکلا",
      "مقالات حقوقی",
      "فرم تماس",
      "ریسپانسیو",
      "سئو",
    ],

    technologies: ["React", "WordPress"],

    price: "شروع از ۱۷ میلیون تومان",

    time: "۱۵ تا ۲۵ روز کاری",

    icon: FiShield,
    color: "#939105ff",
  },
];
